calm water resistance/KCS/Fr0.1949/0.org/include/initialConditions
flowVelocity          (1.646912 0 0);
Umean                  1.646912;
turbulentKE            4.068476e-04;
turbulentOmega         1.131338e+00;
turbulentEpsilon       2.761693e-07;
turbulentNut           3.420000e-06;
transitionTu           1.000000e+00;
transitionLambdaTheta  0.000000e+00;
transitionFLambdaTheta 1.000000e+00;
transitionReThetat     5.843016e+02;
#inputMode       merge;