calm water resistance/KCS/Fr0.1949/0.org/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
	version     2.0;
	format      ascii;
	class       volScalarField;
	location    "0";
	object      omega;
}

#include      "include/initialConditions";

dimensions    [0 0 -1 0 0 0 0];

internalField uniform $turbulentOmega;

boundaryField
{
	#includeEtc	"caseDicts/setConstraintTypes"

	inlet
	{
		type	fixedValue;
		value	$internalField;
	}


	outlet
	{
		type	zeroGradient;
	}


	midPlane
	{
		type	symmetryPlane;
	}


	top
	{
		type	inletOutlet;
		inletValue	$internalField;
		value	$internalField;
	}


	hull
	{
		type	omegaWallFunction;
		value	$internalField;
		blending	exponential;
	}


	deck
	{
		type	omegaWallFunction;
		value	$internalField;
		blending	exponential;
	}


	rudder
	{
		type	omegaWallFunction;
		value	$internalField;
		blending	exponential;
	}

}
