calm water resistance/KCS/Fr0.1949/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version    2.0;
	format     ascii;
	class      dictionary;
	object     blockMeshDict;
}

scale 1;

vertices
(
	(-14.604923436516444 0 -8.178757124449207)
	(21.907385154774666 0 -8.178757124449207)
	(21.907385154774666 9.055052530640195 -8.178757124449207)
	(-14.604923436516444 9.055052530640195 -8.178757124449207)
	(-14.604923436516444 0 3.797280093494275)
	(21.907385154774666 0 3.797280093494275)
	(21.907385154774666 9.055052530640195 3.797280093494275)
	(-14.604923436516444 9.055052530640195 3.797280093494275)
);

edges
(

);

blocks
(
	hex (0 1 2 3 4 5 6 7) (125 31 41) simpleGrading (1 1 1)
);

boundary
(
	inlet
	{
		type patch;
		faces
		(
			(0 4 7 3)
			(3 2 6 7)
			(0 3 2 1)
		);
	}
	midPlane
	{
		type symmetryPlane;
		faces
		(
			(0 1 5 4)
		);
	}
	outlet
	{
		type patch;
		faces
		(
			(2 6 5 1)
		);
	}
	top
	{
		type patch;
		faces
		(
			(4 5 6 7)
		);
	}
);

